interop-mock/src/main/resources/w3c/variants/XMLP-12-request.xml

<?xml version="1.0" ?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" 
              xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <env:Body>
    <sb:unknownFreakyMethod xmlns:sb="http://soapinterop.org/">
      <inputInteger>${inputInteger}</inputInteger>
    </sb:unknownFreakyMethod>
  </env:Body>
</env:Envelope>
